app/controllers/search_controller.rb

SELECT "users".* FROM "users"
---
	def search
    search = params[:term].present? ? params[:term] : nil
    @users = if search
      # User.where("title LIKE ? OR description LIKE ?","%#{search}%", "%#{search}%")
      User.search(search)