app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).per(5)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("latitude", "longitude", "address", "description", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["latitude", 24.969595], ["longitude", 121.192563], ["address", "國立中央大學"], ["description", "學校"], ["title", "10"], ["created_at", 2017-05-04 01:44:43 UTC], ["updated_at", 2017-05-04 01:44:43 UTC]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "description" = ?, "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["description", "學校大門"], ["avatar", "87.JPG"], ["updated_at", 2017-05-11 01:45:49 UTC], ["id", 1]]